testsuite/sysbench/results/select_random_ranges.lua_threads128/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 28321.98 qps: 28322.01 (r/w/o: 28322.01/0.00/0.00) lat (ms,95%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 28572.81 qps: 28572.76 (r/w/o: 28572.76/0.00/0.00) lat (ms,95%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 28363.59 qps: 28363.59 (r/w/o: 28363.59/0.00/0.00) lat (ms,95%): 33.12 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1711203
        write:                           0
        other:                           0
        total:                           1711203
    transactions:                        1711203 (28510.60 per sec.)
    queries:                             1711203 (28510.60 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      28510.5961
    time elapsed:                        60.0205s
    total number of events:              1711203

Latency (ms):
         min:                                    0.35
         avg:                                    4.49
         max:                                  291.08
         95th percentile:                       33.12
         sum:                              7679412.53

Threads fairness:
    events (avg/stddev):           13368.2969/3264.57
    execution time (avg/stddev):   59.9954/0.03

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 32504.77 qps: 32504.77 (r/w/o: 32504.77/0.00/0.00) lat (ms,95%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 32899.08 qps: 32899.13 (r/w/o: 32899.13/0.00/0.00) lat (ms,95%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 127 tps: 31118.72 qps: 31118.67 (r/w/o: 31118.67/0.00/0.00) lat (ms,95%): 29.19 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1944221
        write:                           0
        other:                           0
        total:                           1944221
    transactions:                        1944221 (32396.44 per sec.)
    queries:                             1944221 (32396.44 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      32396.4372
    time elapsed:                        60.0292s
    total number of events:              1944221

Latency (ms):
         min:                                    0.37
         avg:                                    3.95
         max:                                  168.83
         95th percentile:                       38.25
         sum:                              7676815.52

Threads fairness:
    events (avg/stddev):           15188.7031/454.04
    execution time (avg/stddev):   59.9751/0.01